/**************************************************************************************************
 *                                                                                                *
 *  25 - Leia um valor de área em acres e apresente-o convertido em metros quadrados.             *
 *  A formula de conversão é: M = A * 4046.86, sendo M a área em metros quadrados e A         *
 *  a area em acres.                                                                              *
 *                                                                                                *
 *  by:                                                                                           *
 *     @@@@@ @  @ @      @   @@@@@ @@    @ @@@@@@    @@@@@@  @@@@@@ @@    @ @@@@@@@ @@@@@ @@@@@   *
 *     @     @  @ @     @@   @   @ @ @   @ @    @    @       @    @ @ @   @    @    @   @ @       *
 *     @@@   @@@@ @@@@   @   @@@@@ @  @  @ @    @    @@@@@@  @@@@@@ @  @  @    @    @   @ @@@@@   *
 *     @        @ @  @   @   @   @ @   @ @ @    @         @  @    @ @   @ @    @    @   @     @   *
 *     @        @ @  @   @   @   @ @    @@ @    @         @  @    @ @    @@    @    @   @     @   *
 *     @        @ @@@@ @@@@@ @   @ @     @ @@@@@@    @@@@@@  @    @ @     @    @    @@@@@ @@@@@   *
 *                                                                                                *
 *  Data: 04/10/2020                                                                              *
 *                                                                                                * 
 **************************************************************************************************/
#include<stdio.h>


int main(){

    double m, a;

    printf("--------------------------------------------------------- -----------------------------\n");
    printf("<<<<<< Este Programa lê um valor de área em acres e converte em metros quadrados >>>>>>\n");
    printf("---------------------------------------------------------------------------------------\n");
    printf("\nDigite o valor da área em acres: ");
    scanf("%lf", &a);

    m = a * 4046.86;

    printf("\"%.2f\"acre(s)\n", m);
    printf("\nFIM DO PROGRAMA!!!\n");

  return 0;
}
