/**************************************************************************************************
 *                                                                                                *
 *  29 - Leia quatro notas, calcule a média aritmética e imprima o resultado.                     *
 *                                                                                                *
 *                                                                                                *
 *                                                                                                *
 *  by:                                                                                           *
 *     @@@@@ @  @ @      @   @@@@@ @@    @ @@@@@@    @@@@@@  @    @ @@    @ @@@@@@@ @@@@@ @@@@@   *
 *     @     @  @ @     @@   @   @ @ @   @ @    @    @       @    @ @ @   @    @    @   @ @       *
 *     @@@   @@@@ @@@@   @   @@@@@ @  @  @ @    @    @@@@@@  @@@@@@ @  @  @    @    @   @ @@@@@   *
 *     @        @ @  @   @   @   @ @   @ @ @    @         @       @ @   @ @    @    @   @     @   *
 *     @        @ @  @   @   @   @ @    @@ @    @         @       @ @    @@    @    @   @     @   *
 *     @        @ @@@@ @@@@@ @   @ @     @ @@@@@@    @@@@@@       @ @     @    @    @@@@@ @@@@@   *
 *                                                                                                *
 *  Data: 04/10/2020                                                                              *
 *                                                                                                * 
 **************************************************************************************************/
#include<stdio.h>


int main(){

    float nota1, nota2, nota3, nota4, media;
   

    printf("--------------------------------------------------------- -----------------------------------\n");
    printf("<<<<<< Este programa lê quatro notas, calcula a media aritmética e imprime o resultado >>>>>>\n");
    printf("---------------------------------------------------------------------------------------------\n");
    printf("\nDigite a primeira nota:");
    scanf("%f", &nota1);

    printf("Digite a segunda nota:");
    scanf("%f", &nota2);
  
    printf("Digite a terceira nota:");
    scanf("%f", &nota3);

    printf("Digite a quarta nota:");
    scanf("%f", &nota4);

    media = (nota1 + nota2 + nota3 + nota4)/4;

    printf("\nA média aritmética é:\"%.1f\" \n", media);
    printf("\n--------------------------------------------------------------------------------------------\n");
    printf("<<<<<< FIM DO PROGRAMA!!! >>>>>>");
    printf("\n--------------------------------------------------------------------------------------------\n");

  return 0;
}
